In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
data=pd.read_csv(r"C:\Users\Gazal V\Desktop\Beat\drinks.csv",index_col=0).reset_index(drop=True)

In [3]:
for i in ['beer_servings','spirit_servings', 'wine_servings','total_litres_of_pure_alcohol']:
    data[i]=data[i].fillna(data[i].median())

In [4]:
data.isna().sum()

country                         0
beer_servings                   0
spirit_servings                 0
wine_servings                   0
total_litres_of_pure_alcohol    0
continent                       0
dtype: int64

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    float64
 2   spirit_servings               193 non-null    float64
 3   wine_servings                 193 non-null    float64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(4), object(2)
memory usage: 9.2+ KB

# Label Encoding

In [6]:
from sklearn.preprocessing import LabelEncoder

In [7]:
label_encoder = LabelEncoder()
data['continent']=label_encoder.fit_transform(data['continent'])

In [8]:
data.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0.0,68.5,0.0,4.35,1
1,Albania,89.0,132.0,54.0,4.90,2
2,Algeria,25.0,0.0,14.0,0.70,0
3,Andorra,245.0,138.0,312.0,12.40,2
4,Angola,217.0,57.0,45.0,5.90,0

In [9]:
label_encoder = LabelEncoder()
data['country']=label_encoder.fit_transform(data['country'])

In [10]:
data.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,0.0,68.5,0.0,4.35,1
1,1,89.0,132.0,54.0,4.90,2
2,2,25.0,0.0,14.0,0.70,0
3,3,245.0,138.0,312.0,12.40,2
4,4,217.0,57.0,45.0,5.90,0

In [11]:
data.continent.nunique()

6

In [12]:
data.country.nunique()

193

# One Hot Encoding

In [13]:
data1=pd.read_csv(r"C:\Users\Gazal V\Desktop\Beat\drinks.csv",index_col=0).reset_index(drop=True)

In [14]:
for i in ['beer_servings','spirit_servings', 'wine_servings','total_litres_of_pure_alcohol']:
    data1[i]=data1[i].fillna(data1[i].median())

In [15]:
data1.isna().sum()

country                         0
beer_servings                   0
spirit_servings                 0
wine_servings                   0
total_litres_of_pure_alcohol    0
continent                       0
dtype: int64

In [16]:
data1= pd.get_dummies(data1)

In [17]:
data1.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,country_Afghanistan,country_Albania,country_Algeria,country_Andorra,country_Angola,country_Antigua & Barbuda,...,country_Vietnam,country_Yemen,country_Zambia,country_Zimbabwe,continent_Africa,continent_Asia,continent_Europe,continent_North America,continent_Oceania,continent_South America
0,0.0,68.5,0.0,4.35,1,0,0,0,0,0,...,0,0,0,0,0,1,0,0,0,0
1,89.0,132.0,54.0,4.90,0,1,0,0,0,0,...,0,0,0,0,0,0,1,0,0,0
2,25.0,0.0,14.0,0.70,0,0,1,0,0,0,...,0,0,0,0,1,0,0,0,0,0
3,245.0,138.0,312.0,12.40,0,0,0,1,0,0,...,0,0,0,0,0,0,1,0,0,0
4,217.0,57.0,45.0,5.90,0,0,0,0,1,0,...,0,0,0,0,1,0,0,0,0,0

In [18]:
data1.shape

(193, 203)